#pragma once
/* EvryThng.h – Включает все стандартные и пользовательские */

/* заголовочные файлы. */

#include "Exclude.h" /* Исключает описания, которые не требуются для примеров программ.*/ 

#include "envirmnt.h" 

#include <windows.h> 

#include <tchar.h> 

#include <stdio.h> 

#include <io.h> 

#include "support.h" 

#ifdef _MT
//#define _MT

#include <process.h> 

/* DWORD_PTR (целое без знака, соответствующее точности указателя)

* используется для целых чисел, преобразуемых в дескрипторы или указатели.

* Благодаря этому в Win64 не будут выводиться предупреждающие сообщения,

* касающиеся взаимных преобразований 32-битовых и 64-битовых данных,

* поскольку в Win64 дескрипторы HANDLE и указатели являются 64-битовыми

* (см. главу 16). Этот режим активизируется только в том случае,

* если определена символическая константа _Wp64.

*/

#if !defined(_Wp64) 

#define DWORD_PTR DWORD 

#define LONG_PTR LONG 

#define INT_PTR INT 

#endif
#endif